import numpy as np
"""
Завдання №2:
 TODO: Mетод безпосереднього оцінювання
 Варіант - №2
*------------------------------*
        Експерт 1
#     | О1  | О2  | О3  |
# | О1| 0.5 | 0.5 | 0.1 |
# | О2| 0.5 | 0.5 | 0.5 |
# | О3| 0   | 0.5 | 0.5 |
*------------------------------*
        Експерт 2
#     | О1 | О2  | О3  |
# | О1| 0.5 | 1   | 1   |
# | О2| 0   | 0.5 | 0   |
# | О3| 0   | 1   | 0.5 |
*------------------------------*
        Експерт 3
#      | О1 | О2  | О3  |
# | О1| 0.5 | 0.5 | 0   |
# | О2| 0.5 | 0.5 | 0   |
# | О3| 1   | 1   | 0.5 |
*------------------------------*
"""

matrix_1 = np.array(
    [[0.5, 0.5, 1],
     [0.5, 0.5, 0.5],
     [0, 0.5, 0.5]])

matrix_2 = np.array(
    [[0.5, 1, 1],
     [0, 0.5, 0],
     [0, 1, 0.5]])

matrix_3 = np.array(
    [[0.5, 0.5, 0],
     [0.5, 0.5, 0],
     [1, 1, 0.5]])

math_expect = (matrix_1 + matrix_2 + matrix_3) / 3

print('\nМатематичні очікування:')
print(math_expect)

Y_1 = np.sum(math_expect, axis=1)
lambda_1 = np.sum(Y_1)
k_1 = (1 / lambda_1) * Y_1

Y_2 = np.sum(math_expect * k_1, 1)
lambda_2 = np.sum(Y_2)
k_2 = (1 / lambda_2) * Y_2

print('\n')
for i in range(3):
    a = k_2 - k_1
    print(f'k{i}:', round(a[i], 3))
